Revit 2026 API

# LineCreateUnbound Method

---

Creates a new instance of an unbound linear curve.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static Line CreateUnbound(
	XYZ origin,
	XYZ direction
)
```
```vb
Public Shared Function CreateUnbound (
	origin As XYZ,
	direction As XYZ
) As Line
```
```cpp
public:
static Line^ CreateUnbound(
	XYZ^ origin,
	XYZ^ direction
)
```
```fsharp
static member CreateUnbound :
        origin : XYZ *
        direction : XYZ -> Line
```

#### Parameters

origin XYZ
     The origin of the unbound line.
direction XYZ
     The direction of the unbound line.

#### Return Value

Line The new unbound line.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was NULL |
| ArgumentOutOfRangeException | direction has zero length. |
| ArgumentsInconsistentException | Vector and origin cannot form a proper unbound line. |

#### Reference

Line Class

Autodesk.Revit.DB Namespace